# Introduction to `pandas`

**`pandas`** is designed to make it easier to work with structured data. Most of the analyses you might perform will likely involve using tabular data, e.g., from .csv files or relational databases (e.g., SQL). The **`DataFrame`** object in `pandas` is "a two-dimensional tabular, column-oriented data structure with both row and column labels."

If you're curious:

>The **`pandas**` name itself is derived from *panel data*, an econometrics term for multidimensional structured data sets, and *Python data analysis* itself. After getting introduced, you can consult the full [`pandas` documentation](http://pandas.pydata.org/pandas-docs/stable/).

Today we will work with example data and go through the various steps you might need to prepare data for analysis. You'll (hopefully) realize that doing this type of work is much easier using `pandas` instead of Python's built-in data structures.

This notebook uses data files from the `Week3/data/` directory.

In [1]:
import pandas as pd
import matplotlib as mpl
import matplotlib.pyplot as plt
%matplotlib inline

mpl.rc('savefig', dpi=200)
plt.style.use('seaborn-paper')
plt.rcParams['xtick.minor.size'] = 0
plt.rcParams['ytick.minor.size'] = 0

# `read_csv()`

The **`read_csv()`** function in `pandas` allows us to easily import our data. By default, it assumes the data is comma-delimited. However, you can specify the delimiter used in your data (e.g., tab, semicolon, pipe, etc.). See the documentation [here](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html).

In [2]:
unemployment = pd.read_csv('data/country_total.csv')
print(type(unemployment))

<class 'pandas.core.frame.DataFrame'>

# `head` and `tail`

- Shows first five rows by default.  
- **`.head()`** will return the default first five rows. 
- **`.tail()`** will show you the last five rows. 

- For both, include an integer **`n`** to show the `n` number of rows.

In [3]:
unemployment.head(17)

   country seasonality    month  unemployment  unemployment_rate
0       at         nsa  1993.01        171000                4.5
1       at         nsa  1993.02        175000                4.6
2       at         nsa  1993.03        166000                4.4
3       at         nsa  1993.04        157000                4.1
4       at         nsa  1993.05        147000                3.9
5       at         nsa  1993.06        134000                3.5
6       at         nsa  1993.07        128000                3.4
7       at         nsa  1993.08        130000                3.4
8       at         nsa  1993.09        132000                3.5
9       at         nsa  1993.10        141000                3.7
10      at         nsa  1993.11        156000                4.1
11      at         nsa  1993.12        169000                4.4
12      at         nsa  1994.01        180000                4.7
13      at         nsa  1994.02        180000                4.7
14      at         nsa  1994.03        164000                4.3
15      at         nsa  1994.04        152000                4.0
16      at         nsa  1994.05        143000                3.8

# `len` and `shape`

- `len` will show you the number of rows. 
- `shape` will show number of rows by number of columns.

In [4]:
len(unemployment)

20796

In [5]:
# There are 20,796 rows and 5 columns.
unemployment.shape

(20796, 5)

# `describe`

A useful method that generates various summary statistics is `.describe()`.

In [8]:
pd.set_option('display.float_format', lambda x: '%.2f' % x) # This first line of code turns off scientific notation. 

unemployment.describe()

         month  unemployment  unemployment_rate
count 20796.00      20796.00           19851.00
mean   1999.40     790081.79               8.18
std       7.48    1015280.06               3.92
min    1983.01       2000.00               1.10
25%    1994.09     140000.00               5.20
50%    2001.01     310000.00               7.60
75%    2006.01    1262250.00              10.00
max    2010.12    4773000.00              20.90

Some notes about summary statistics: 

- "count" is lower for unemployment_rate and includes only non-missing values.  
-  The values depend on what it's called on. 
    - If our `DataFrame` includes both numeric and object (e.g., strings) `dtype`s, it will default to summarizing the numeric data. 
    - If called on strings, it will return the count, number of unique values, and the most frequent value along with its count if called.

# Renaming columns

You may have noticed that the `month` column also includes the year. Let's go ahead and rename it.

In [9]:
unemployment.rename(columns={'month' : 'year_month'}, inplace=True)
unemployment.head()

  country seasonality  year_month  unemployment  unemployment_rate
0      at         nsa     1993.01        171000               4.50
1      at         nsa     1993.02        175000               4.60
2      at         nsa     1993.03        166000               4.40
3      at         nsa     1993.04        157000               4.10
4      at         nsa     1993.05        147000               3.90

The **`.rename()`** method allows you to modify index labels and/or column names. As you can see, we passed a `dict` to the `columns` parameter, with the original name as the key and the new name as the value. Importantly, we also set the `inplace` parameter to `True`, which modifies the *actual* `DataFrame`, not a copy of it.

# Select a single column

It might also make sense to separate the data in `year_month` into two separate columns. To do this, you'll need to know how to select a single column. We can either use bracket (`[]`) or dot notation (referred to as *attribute access*).

In [14]:
unemployment['year_month'].head()

0   1993.01
1   1993.02
2   1993.03
3   1993.04
4   1993.05
Name: year_month, dtype: float64

In [12]:
unemployment.year_month.head()

0   1993.01
1   1993.02
2   1993.03
3   1993.04
4   1993.05
Name: year_month, dtype: float64

It is preferrable to use the bracket notation as a column name might inadvertently have the same name as a `DataFrame` (or `Series`) method. In addition, **only bracket notation can be used to create a new column.** If you try and use attribute access to create a new column, you'll create a new attribute, *not* a new column.

When selecting a single column, we have a `pandas` **`Series`** object, which is a single vector of data (e.g., a NumPy array) with "an associated array of data labels, called its **index**. A `DataFrame` also has an index. In our example, the indices are an array of sequential integers, which is the default. You can find them in the left-most position, without a column label.

Indices need not be a sequence of integers. They can, for example, be dates or strings. Indices, like column names, can be used to select data. Indices can be used to select particular rows. In fact, you can do something like `.head()` with slicing using the `[]` operator.

In [17]:
unemployment.head()[:5]

  country seasonality  year_month  unemployment  unemployment_rate
0      at         nsa     1993.01        171000               4.50
1      at         nsa     1993.02        175000               4.60
2      at         nsa     1993.03        166000               4.40
3      at         nsa     1993.04        157000               4.10
4      at         nsa     1993.05        147000               3.90

# Indexing

# `loc`

Before we continue, let's look at a few useful ways to index data - that is, select rows.

`.loc` primarily works with string labels. It accepts a single label, a list (or array) of labels, or a slice of labels (e.g., `'a' : 'f'`).

Let's create a `DataFrame` to see how this works. (This is based on an [example](https://github.com/fonnesbeck/scipy2015_tutorial/blob/master/notebooks/1.%20Data%20Preparation.ipynb) from Chris Fonnesbeck's [Computational Statistics II Tutorial](https://github.com/fonnesbeck/scipy2015_tutorial).)

In [18]:
bacteria = pd.DataFrame({'bacteria_counts' : [632, 1638, 569, 115],
                         'other_feature' : [438, 833, 234, 298]},
                         index=['Firmicutes', 'Proteobacteria', 'Actinobacteria', 'Bacteroidetes'])

Notice that we pass in a `dict`, where the keys correspond to column names and the values to the data. In this example, we've also set the indices&mdash;strings in this case&mdash;to be the taxon of each bacterium.

In [19]:
bacteria

                bacteria_counts  other_feature
Firmicutes                  632            438
Proteobacteria             1638            833
Actinobacteria              569            234
Bacteroidetes               115            298

Now, if we're interested in the values (row) associated with "Actinobacteria," we can use `.loc` and the index name.

In [20]:
#integer type

bacteria.loc['Actinobacteria']

bacteria_counts    569
other_feature      234
Name: Actinobacteria, dtype: int64

# Positional indexing

This returns the column values for the specified row. Interestingly, we could have also used "positional indexing," even though the indices are strings.

In [24]:
#DataFrame type

bacteria[2:3]

                bacteria_counts  other_feature
Actinobacteria              569            234

The difference is that the former returns a `Series` because we selected a single lable, while the latter returns a `DataFrame` because we selected a range of positions.

# `iloc`

Let's return to our unemployment data. Another indexing option, `.iloc`, primarily works with integer positions. To select specific rows, we can do the following.

In [26]:
unemployment.iloc[[1, 5, 6, 9]]

  country seasonality  year_month  unemployment  unemployment_rate
1      at         nsa     1993.02        175000               4.60
5      at         nsa     1993.06        134000               3.50
6      at         nsa     1993.07        128000               3.40
9      at         nsa     1993.10        141000               3.70

We can select a range of rows and specify the step value.

In [25]:
#striding[x:y:z])

unemployment.iloc[25:50:5]

   country seasonality  year_month  unemployment  unemployment_rate
25      at         nsa     1995.02        174000               4.50
30      at         nsa     1995.07        123000               3.30
35      at         nsa     1995.12        175000               4.70
40      at         nsa     1996.05        159000               4.30
45      at         nsa     1996.10        146000               3.90

**Note:** As is typical in Python, the end position is not included (we don't see the row associated with the index 50)

# `ix`

Finally, `.ix` enables mixed label- or integer-based indexing:

In [28]:
unemployment.ix[25:50:5, 'year_month']

25   1995.02
30   1995.07
35   1995.12
40   1996.05
45   1996.10
50   1997.03
Name: year_month, dtype: float64

# Split `year_month` into two separate columns

# `astype`

Above, we saw that this column is type (technically, `dtype`) `float64`. 

- First extract the year using the `.astype()` method. This allows for type casting - basically converting from one type to another. 
- We'll then subtract this value from `year_month` to get the decimal portion of the value and multiply the result by 100 and convert to `int`.

For more information on `pandas` `dtype`s, check the documentation [here](http://pandas.pydata.org/pandas-docs/stable/basics.html#dtypes).

In [29]:
unemployment['year'] = unemployment['year_month'].astype(int)
unemployment.head()

  country seasonality  year_month  unemployment  unemployment_rate  year
0      at         nsa     1993.01        171000               4.50  1993
1      at         nsa     1993.02        175000               4.60  1993
2      at         nsa     1993.03        166000               4.40  1993
3      at         nsa     1993.04        157000               4.10  1993
4      at         nsa     1993.05        147000               3.90  1993

**NOTE:** we're casting the floating point values to integers. In Python, this [truncates the decimals](https://docs.python.org/2/library/stdtypes.html#numeric-types-int-float-long-complex).

Let's create our **month** variable as described above. (Because of the truncating that occurs when casting to `int`, we first round the values to the nearest whole number.)

In [30]:
unemployment['month'] = ((unemployment['year_month'] - unemployment['year']) * 100).round(0).astype(int)

In [36]:
unemployment.head(13)

,country,seasonality,year_month,year,month,unemployment,unemployment_rate
0,at,nsa,1993.01,1993,1,171000,4.50
1,at,nsa,1993.02,1993,2,175000,4.60
2,at,nsa,1993.03,1993,3,166000,4.40
3,at,nsa,1993.04,1993,4,157000,4.10
4,at,nsa,1993.05,1993,5,147000,3.90
5,at,nsa,1993.06,1993,6,134000,3.50
6,at,nsa,1993.07,1993,7,128000,3.40
7,at,nsa,1993.08,1993,8,130000,3.40
8,at,nsa,1993.09,1993,9,132000,3.50
9,at,nsa,1993.10,1993,10,141000,3.70
10,at,nsa,1993.11,1993,11,156000,4.10
11,at,nsa,1993.12,1993,12,169000,4.40
12,at,nsa,1994.01,1994,1,180000,4.70

To create the `month` column, we subtracted two vectors. This resulted in the decimal value in `year_month`. To transform the values to integers, we multiplied by 100.

Now, let's say we wanted to **reorder the columns** in the `DataFrame`. For this, we use bracket notation again, passing in a list of column names in the order we'd like to see them.

In [33]:
unemployment = unemployment[['country', 'seasonality',
                             'year_month', 'year', 'month',
                             'unemployment', 'unemployment_rate']]

In [37]:
unemployment.head(13)

,country,seasonality,year_month,year,month,unemployment,unemployment_rate
0,at,nsa,1993.01,1993,1,171000,4.50
1,at,nsa,1993.02,1993,2,175000,4.60
2,at,nsa,1993.03,1993,3,166000,4.40
3,at,nsa,1993.04,1993,4,157000,4.10
4,at,nsa,1993.05,1993,5,147000,3.90
5,at,nsa,1993.06,1993,6,134000,3.50
6,at,nsa,1993.07,1993,7,128000,3.40
7,at,nsa,1993.08,1993,8,130000,3.40
8,at,nsa,1993.09,1993,9,132000,3.50
9,at,nsa,1993.10,1993,10,141000,3.70
10,at,nsa,1993.11,1993,11,156000,4.10
11,at,nsa,1993.12,1993,12,169000,4.40
12,at,nsa,1994.01,1994,1,180000,4.70

# Country names

So far, our `DataFrame` is organized in a reasonable way. But, we know we can do better. We're eventually going to be interested in the unemployment rate for each country. The trouble is, we don't exactly know what the values in `country` refer to. We can fix that by getting country names. These can be found in `countries.csv`. However, instead of loading the file in `data/`, why not try something else?

In [38]:
countries_url = 'https://raw.githubusercontent.com/dlab-berkeley/introduction-to-pandas/master/data/countries.csv'
countries = pd.read_csv(countries_url)

Yes, `read_csv()` can take a URL for the file path.

In [45]:
#check the size of the dataframe. how?

countries.head()

,country,google_country_code,country_group,name_en,name_fr,name_de,latitude,longitude
0,at,AT,eu,Austria,Autriche,Österreich,47.70,13.35
1,be,BE,eu,Belgium,Belgique,Belgien,50.50,4.48
2,bg,BG,eu,Bulgaria,Bulgarie,Bulgarien,42.73,25.48
3,hr,HR,non-eu,Croatia,Croatie,Kroatien,44.75,15.34
4,cy,CY,eu,Cyprus,Chypre,Zypern,35.13,33.43

# Merging files

This file has lots of useful information. It even has the country names is three different languages.

Because the data we need is stored in two separate files, we'll want to merge the data somehow. Let's determine which column we can use to join this data. `country` looks like a good option. However, we don't need all of the columns in the `countries` `DataFrame`. To select certain columns, we use the name bracket notation we used to reorder the columns.

In [44]:
country_names = countries[['country', 'country_group', 'name_en']]

In [46]:
country_names.head()

  country country_group   name_en
0      at            eu   Austria
1      be            eu   Belgium
2      bg            eu  Bulgaria
3      hr        non-eu   Croatia
4      cy            eu    Cyprus

`pandas` includes an easy-to-use merge method. Let's use it to **merge the two `DataFrame`s on country code.**

In [47]:
unemployment = pd.merge(unemployment, country_names, on='country')

Merging is often more complex than this example. If you want to merge on multiple columns, you can pass a list of column names to the `on` parameter.

```
pd.merge(first, second, on=['name', 'id'])
```

You might even need to merge on columns with different names. To do so, use the `left_on` and `right_on` parameters, where the first listed `DataFrame` is the "left" one and the second is the "right." It might look something this.

```
pd.merge(one, two, left_on='city', right_on='city_name')
```

For more information on merging, check the [documentation](http://pandas.pydata.org/pandas-docs/stable/merging.html#database-style-dataframe-joining-merging).

`pandas` also provides a `.merge()` method that can act on a `DataFrame`. You can read more about that [here](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html).

In [48]:
unemployment.head()

,country,seasonality,year_month,year,month,unemployment,unemployment_rate,country_group,name_en
0,at,nsa,1993.01,1993,1,171000,4.50,eu,Austria
1,at,nsa,1993.02,1993,2,175000,4.60,eu,Austria
2,at,nsa,1993.03,1993,3,166000,4.40,eu,Austria
3,at,nsa,1993.04,1993,4,157000,4.10,eu,Austria
4,at,nsa,1993.05,1993,5,147000,3.90,eu,Austria

# `unique` and `nunique`

That's better. We now know that the abbreviation "at" corresponds to Austria. We might be curious to check what countries we have data for. The `Series` object includes a **`.unique()`** method. We'll use this to check the countries. We can select the name either using bracket or dot notation. (While we suggested using brackets above, it *is* sometimes easier to use dot notation. Just be careful.)

In [ ]:
unemployment.name_en.unique()

To get a count of the **number of unique countries,** we can either wrap the above code with `len()` to get the number of items in the array, or we can use the  `Series.nunique()` method.

In [ ]:
unemployment.name_en.nunique()

# `value_counts`

It might be more interesting to know **how many observations** we actually have. `pandas` has a `Series` method called `.value_counts()` that returns the counts for the unique values in the `Series`.

In [ ]:
unemployment['name_en'].value_counts()

By default, the `Series` is sorted by values. If you'd like it sorted by index - country name in this case - append the `.sort_index()` method.

In [ ]:
unemployment['name_en'].value_counts().sort_index()

This will be useful for our analysis. The maximum number of observations for a given country for this time period is 1,008 observations. We'll note that certain countries, such as Turkey, have far less data.

# Find a date range
How about finding the **date range** for this data set? Let's look at the minimum and maximum years.

In [ ]:
unemployment['year'].min(), unemployment['year'].max()

# `isnull`

Next, we should pause for a moment and think about what data we really care about. For our purposes, the variable of interest is `unemployment_rate`. The number of observations by country only reflect the number of instances of each country name in the dataset. It is possible, maybe even expected, to have some missing data within those instances. Let's find out **how many unemployment rate values are missing.**

In [ ]:
unemployment['unemployment_rate'].isnull().sum()

The `.isnull()` method returns a corresponding boolean value for each entry in the unemployment rate `Series`. In Python `True` is equivalent to 1 and `False` is equivalent to 0. Thus, when we add the result (with `.sum()`), we get a count for the *total* number of missing values.

What if we'd like to know how many missing values exist at the *country* level? We can take the main part of what we had above and create a new column in the `DataFrame`.

In [ ]:
unemployment['unemployment_rate_null'] = unemployment['unemployment_rate'].isnull()

To count the **number of missing values for each country,** we introduce the `.groupby()` method.

In [ ]:
unemployment.groupby('name_en')['unemployment_rate_null'].sum()

Let's explain what just happened. We start with our `DataFrame`. We tell `pandas` that we want to group the data by country name&mdash;that's what goes in the parentheses. Next, we need to tell it what column we'd like to perform the `.sum()` operation on. In this case, it's the indicator for whether or not the unemployment rate was missing.

As we saw above, the number of records for each country differs. We might, then, want to have the **missing values by country shown as percentages.** Let's create a new `DataFrame` for this.

We'll take the code from above and set the `as_index` parameter to `False`.

In [ ]:
unemployment_rate = unemployment.groupby('name_en', as_index=False)['unemployment_rate_null'].sum()

In [ ]:
unemployment_rate.head(5)

`unemployment_rate` is a `DataFrame` with the information from cells above. It's important to note that using `as_index=False` in `.groupby()` only works if the grouping column(s) are not the same as the columns on which we're performing the operation.

Also, to group by several columns, simply pass in a list of column names to `.groupby()`.

```
unemployment.groupby(['name_en', 'seasonality'])['unemployment_rate'].mean()
```

# Add number of observations by country

Now, let's add the number of observations by country to the `DataFrame`.

In [ ]:
unemployment_rate['n_obs'] = unemployment.groupby('name_en')['name_en'].count().values

Here, we need to use the `values` attribute to get an array of the counts. Excluding `values` will result in a column full of `NaN`s. This is because the index in `unemployment.groupby('name_en')['name_en'].count()` is a list of the country names. When creating a new column, `pandas` tries to match on index. Recall that the default index values for a `DataFrame` is a sequence of integers.

Because we know (or have noticed) that the `.groupby()` function returns the values in alphabetical order, we can simply set the new column to the list of values, as we have done. You can, however, be more explicit and create another `DataFrame` and merge on country name.

Finally, let's create the column for the percentage of missing values.

In [ ]:
unemployment_rate['null_percentage'] = unemployment_rate['unemployment_rate_null'] / unemployment_rate['n_obs']

In [ ]:
unemployment_rate

This is the second time we've called a `DataFrame` without something like `.head()`. Let's describe what it does. By default, `pandas` prints 60 rows. In this case, because there are only 30 countries, we see the entire `DataFrame`.

As we can see, Croatia has lots of missing data. This `DataFrame` contains useful information&mdash;things to consider&mdash;when analyzing the data.

Suppose we wanted to save this as a .csv file. For this, we'd use the `.to_csv()` method.

In [ ]:
unemployment_rate.to_csv('data/unemployment_missing.csv')

Let's look at our file.

In [ ]:
!head -5 data/unemployment_missing.csv

By default, this method writes the indices. We probably don't want that. Let's edit the code. Let's also be explicit about the type of delimiter we're interested in. (Values can be separated by pipes (`|`), semicolons (`;`), tabs (`\t`), etc.)

In [ ]:
unemployment_rate.to_csv('data/unemployment_missing.csv', index=False, sep=',')

In [ ]:
!head -5 data/unemployment_missing.csv

Much better!

# `drop`

Let's return to our main `DataFrame`. Now that we have the missing values information in `unemployment_rate`, we can **drop the last column** we added to `unemployment`.

In [ ]:
unemployment.drop('unemployment_rate_null', axis=1, inplace=True)

It's important to specify the `axis` parameter. `axis=1` refers to columns (`axis=0` refers to rows.) The parameter `inplace=True` simply modifies the actual `DataFrame` rather than returning a new `DataFrame`.

In [ ]:
unemployment.head()

# Missing values

Now that we know about the missing values, we have to deal with them. There are two main options:

* Fill the missing values with some other values.
* Do not use observations with missing values.
    * Depending on the analysis, we may want to exclude entire countries.
    
Because countries with missing unemployment rate data have at least 36 missing values, which is too many to fill, we'll take the second approach and **exclude missing values** from our primary analyses.

Instead of just getting rid of that data, it might make sense to store it in a separate `DataFrame`. This way, we could answer questions such as, "do missing values occur during certain months (or years) more frequently?" With this, we will introduce the concept of *boolean indexing* for filtering data.

In [ ]:
unemployment_rate_missing = unemployment[unemployment['unemployment_rate'].isnull()]

Recall that `unemployment['unemployment_rate'].isnull()` produces an array of boolean values. We used this previously when counting the number of missing values, though we did not see its output. Let's see some of that now.

In [ ]:
unemployment['unemployment_rate'].isnull()[:10]

To create `unemployment_rate_missing`, we're indexing `unemployment` with the array above. This returns only the rows where the value in the array is `True`. Let's see if it worked.

In [ ]:
unemployment_rate_missing.head()

It is also possible to specify multiple conditions using the `&` operator, but each condition needs to be inside of parentheses. The `.isin()` method, which takes a `list` of values, is useful when you're interested in conditioning on multiple values on a given column. For example, if you want to select multiple countries.

# `dropna`

Now, we're ready to remove the missing data in `unemployment`. To do this, we can use the `.dropna()` method.

In [ ]:
unemployment.dropna(subset=['unemployment_rate'], inplace=True)

(Note that while we have dropped all observations for which `unemployment_rate == NaN`, this doesn't mean that all of our observations overlap exactly in time. We may find that there are dates where we have data for one country and no data for others.)

At this point, you might be curious to know what the highest unemployment rates were. For this, we'll use the `DataFrame.sort_values()` method to **sort the data.**

In [ ]:
unemployment.sort_values('unemployment_rate', ascending=False)[:5]

The above code creates a copy of the `DataFrame`, sorted in *descending* order, and prints the first five rows.

You may have noticed that the data set includes a `seasonality` column, which we haven't yet discussed. The unemployment rate in this data is actually calculated in three separate ways. Let's look at the values.

In [ ]:
unemployment['seasonality'].unique()

The three options above correspond to:

* not seasonally adjusted
* seasonally adjusted
* trend cycle

We'll stick with seasonally adjusted data so that the values are more comparable. Let's look at the highest unemployment rates in this context.

In [ ]:
unemployment[unemployment['seasonality'] == 'sa'].sort_values('unemployment_rate', ascending=False)[:5]

# Plotting

Spain has the highest seasonally adjusted unemployment rate.

The best way to get a sense of this data is to **plot it.** Next, we'll start to look at some basic plotting with `pandas`. Before we begin, let's sort the data by country and date. This is good practice and is especially important when using `pandas`'s `.plot()` method because the x-axis values are based on the indices. When we sort, the index values remain unchanged. Thus, we need to reset them. The `drop` parameter tells `pandas` to construct a `DataFrame` *without* adding a column.

In [ ]:
unemployment.sort_values(['name_en', 'year_month'], inplace=True)
unemployment.reset_index(drop=True, inplace=True)

Let's take a look at Spain's unemployment rate (only because it was the highest) across time.

In [ ]:
spain = unemployment[(unemployment['name_en'] == 'Spain') &
                     (unemployment['seasonality'] == 'sa')]

In [ ]:
spain['unemployment_rate'].plot(figsize=(10, 8), color='blue')

Note that the values along the x-axis represent the indices associated with Spain in the sorted `unemployment` `DataFrame`. Wouldn't it be nice if, instead, we could **show the time period** associated with the various unemployment rates for Spain? It might also be interesting to **compare** Spain's unemployment rate with its neighbor to the west, Portugal.

Let's first create a `DataFrame` that contains the unemployment data for both countries.

In [ ]:
ps = unemployment[(unemployment['name_en'].isin(['Portugal', 'Spain'])) &
                  (unemployment['seasonality'] == 'sa')]

Next, we'll **generate time series data** by converting our years and months into `datetime` objects. `pandas` provides a `to_datetime()` function that makes this relatively simple. It converts an argument&mdash;a single value or an array of values&mdash;to `datetime`. (Note that the return value [depends on the input](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.to_datetime.html).) If we were interested in March 23, 1868, for example, we could do the following.

In [ ]:
pd.to_datetime('1868/3/23')

The argument doesn't necessarily have to be specified in the `yyyy/mm/dd` format. You could list it as `mm/dd/yyyy`, but it's a good idea to be explicit. As a result, we pass in a valid string format.

In [ ]:
pd.to_datetime('3/23/1868', format='%m/%d/%Y')

Let's create the `datetime` object and add it to the `DataFrame` as a column named `date`. For this, we'll use the `DataFrame.insert()` method.

In [ ]:
ps.insert(loc=0, column='date',
          value=pd.to_datetime(ps['year'].astype(str) + '/' + ps['month'].astype(str) + '/1'))

Finally, let's only keep certain columns, rename them, and reshape the `DataFrame`.

In [ ]:
ps = ps[['date', 'name_en', 'unemployment_rate']]
ps.columns = ['Time Period', 'Country', 'Unemployment Rate']
ps = ps.pivot(index='Time Period', columns='Country', values='Unemployment Rate')
ps.tail()

In [ ]:
ps.head()

Notice the indices.

In [ ]:
ps.plot(figsize=(10, 8), title='Unemployment Rate\n')

#### Bonus
Note that there are some dates for which we lack data on Spain's unemployment rate. What could you do if you wanted your plot to show only dates where both Spain and Portugal have a defined unemployment rate?

# Challenge

To participate in the geopandas portion examples tomorrow, make sure to: 

1. load "Louisiana Census Population Data 1810-1860.csv" as a pandas DataFrame. Name this variable "LA". 
2. add three columns to it:  
    - "w_nonw" = proportion of white to non-white  
    - "w_nonws" = proportion of white to non-white slaves  
    - "nwf_nws" = proportion of non-white free to non-white slaves  
3. save this updated DataFrame as "LA.csv"

In [50]:
LA = pd.read_csv('Louisiana Census Population Data 1810-1860.csv')

print(type(LA))

<class 'pandas.core.frame.DataFrame'>

In [51]:
LA.head(5)

,OBJECTID,GISJOIN,longitude,latitude,orig_parish,current_parish,census_year,census_state,census_state_code,census_county_code,census_county,total_pop,nwfree_pop,nwslave_pop,white_pop,yeardate_format
0,1,G4170335,-90.36,29.88,St Charles,St Charles,1810,Orleans Territory,417,335,St Charles,3291,150,2321,820,1810-01-01
1,2,G2200890,-90.36,29.88,St Charles,St Charles,1820,Louisiana,220,890,St Charles,3862,148,2987,727,1820-01-01
2,3,G2200890,-90.36,29.88,St Charles,St Charles,1830,Louisiana,220,890,St Charles,5147,158,4118,871,1830-01-01
3,4,G2200890,-90.36,29.88,St Charles,St Charles,1840,Louisiana,220,890,St Charles,4700,104,3722,874,1840-01-01
4,5,G2200890,-90.36,29.88,St Charles,St Charles,1850,Louisiana,220,890,St Charles,5120,121,4132,867,1850-01-01

In [55]:
LA.tail(5)

,OBJECTID,GISJOIN,longitude,latitude,orig_parish,current_parish,census_year,census_state,census_state_code,census_county_code,census_county,total_pop,nwfree_pop,nwslave_pop,white_pop,yeardate_format
91,92,G2200290,-91.46,31.78,Concordia,Concordia,1820,Louisiana,220,290,Concordia,2626,12,1787,827,1820-01-01
92,93,G2200290,-91.46,31.78,Concordia,Concordia,1830,Louisiana,220,290,Concordia,4662,20,3617,1025,1830-01-01
93,94,G2200290,-91.46,31.78,Concordia,Concordia,1840,Louisiana,220,290,Concordia,9414,31,8003,1380,1840-01-01
94,95,G2200290,-91.46,31.78,Concordia,Concordia,1850,Louisiana,220,290,Concordia,7758,1,6934,823,1850-01-01
95,96,G2200290,-91.46,31.78,Concordia,Concordia,1860,Louisiana,220,290,Concordia,13805,21,12542,1242,1860-01-01

In [58]:
#add three columns to it:
#"w_nonw" = proportion of white to non-white
#"w_nonws" = proportion of white to non-white slaves
#"nwf_nws" = proportion of non-white free to non-white slaves
#save this updated DataFrame as "LA.csv"

In [67]:
#2A

LA["w_nonw"] = LA["white_pop"] / LA["total_pop"]
LA.head()

,OBJECTID,GISJOIN,longitude,latitude,orig_parish,current_parish,census_year,census_state,census_state_code,census_county_code,census_county,total_pop,nwfree_pop,nwslave_pop,white_pop,yeardate_format,w_nonw
0,1,G4170335,-90.36,29.88,St Charles,St Charles,1810,Orleans Territory,417,335,St Charles,3291,150,2321,820,1810-01-01,0.25
1,2,G2200890,-90.36,29.88,St Charles,St Charles,1820,Louisiana,220,890,St Charles,3862,148,2987,727,1820-01-01,0.19
2,3,G2200890,-90.36,29.88,St Charles,St Charles,1830,Louisiana,220,890,St Charles,5147,158,4118,871,1830-01-01,0.17
3,4,G2200890,-90.36,29.88,St Charles,St Charles,1840,Louisiana,220,890,St Charles,4700,104,3722,874,1840-01-01,0.19
4,5,G2200890,-90.36,29.88,St Charles,St Charles,1850,Louisiana,220,890,St Charles,5120,121,4132,867,1850-01-01,0.17

In [68]:
#2B

LA["w_nonws"] = LA["white_pop"] / LA["nwfree_pop"]
LA.head()

,OBJECTID,GISJOIN,longitude,latitude,orig_parish,current_parish,census_year,census_state,census_state_code,census_county_code,census_county,total_pop,nwfree_pop,nwslave_pop,white_pop,yeardate_format,w_nonw,w_nonws
0,1,G4170335,-90.36,29.88,St Charles,St Charles,1810,Orleans Territory,417,335,St Charles,3291,150,2321,820,1810-01-01,0.25,5.47
1,2,G2200890,-90.36,29.88,St Charles,St Charles,1820,Louisiana,220,890,St Charles,3862,148,2987,727,1820-01-01,0.19,4.91
2,3,G2200890,-90.36,29.88,St Charles,St Charles,1830,Louisiana,220,890,St Charles,5147,158,4118,871,1830-01-01,0.17,5.51
3,4,G2200890,-90.36,29.88,St Charles,St Charles,1840,Louisiana,220,890,St Charles,4700,104,3722,874,1840-01-01,0.19,8.40
4,5,G2200890,-90.36,29.88,St Charles,St Charles,1850,Louisiana,220,890,St Charles,5120,121,4132,867,1850-01-01,0.17,7.17

In [69]:
#2C

LA["nwf_nws"] = LA["nwfree_pop"] / LA["nwslave_pop"]
LA.head()

,OBJECTID,GISJOIN,longitude,latitude,orig_parish,current_parish,census_year,census_state,census_state_code,census_county_code,census_county,total_pop,nwfree_pop,nwslave_pop,white_pop,yeardate_format,w_nonw,w_nonws,nwf_nws
0,1,G4170335,-90.36,29.88,St Charles,St Charles,1810,Orleans Territory,417,335,St Charles,3291,150,2321,820,1810-01-01,0.25,5.47,0.06
1,2,G2200890,-90.36,29.88,St Charles,St Charles,1820,Louisiana,220,890,St Charles,3862,148,2987,727,1820-01-01,0.19,4.91,0.05
2,3,G2200890,-90.36,29.88,St Charles,St Charles,1830,Louisiana,220,890,St Charles,5147,158,4118,871,1830-01-01,0.17,5.51,0.04
3,4,G2200890,-90.36,29.88,St Charles,St Charles,1840,Louisiana,220,890,St Charles,4700,104,3722,874,1840-01-01,0.19,8.40,0.03
4,5,G2200890,-90.36,29.88,St Charles,St Charles,1850,Louisiana,220,890,St Charles,5120,121,4132,867,1850-01-01,0.17,7.17,0.03

In [56]:
len(LA)

96

In [53]:
LA.shape

(96, 16)

In [ ]:
#git pull